---
kind: type
id: T:Autodesk.Revit.Attributes.RegenerationAttribute
source: html/0145b116-6d5c-8a29-ae86-5a558e198575.htm
---
# Autodesk.Revit.Attributes.RegenerationAttribute

The custom regeneration attribute to control the regeneration behavior of the external command or external application.

## Syntax (C#)
```csharp
public class RegenerationAttribute : Attribute
```